puddle/puddle_en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-01 Mon 20:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Puddle</title>
<meta name="author" content="emporas" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Puddle</h1>
<div id="table-of-contents" role="doc-toc">
<h1><a accesskey="H" href="../index.html"> HOME </a></h1><h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7d1b5a0">The lake</a></li>
<li><a href="#org1a5ab2a">The devouring</a></li>
<li><a href="#org3b962a2">The thunderstorm</a></li>
<li><a href="#orgdb7dbf9">The crime</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7d1b5a0" class="outline-2">
<h2 id="org7d1b5a0">The lake</h2>
<div class="outline-text-2" id="text-org7d1b5a0">
<p>
The sun that bloated, blistering tyrant burned its orange-red fingerprints into the earth, a giant’s thumb smushing a cake of ash and dust. The lake once a primordial womb of algae and mystery, now a primordial mire was shrinking at a rate that made time itself look slothful.
</p>

<p>
We crocs, the last survivors of the Great Deluge, or whatever that disaster was back when it still rained and trees hadn’t all committed suicide.  Our water had boiled down to a witch’s teat, and tensions between us, the toothy survivors of the wetland regime, simmered hotter than a jalapeño in a sauna. Even the mud&rsquo;s tang stiff and briny, stuck to the tongue like a bad breakup song.
</p>

<p>
My belly, which had been a lean, lethal curve of prehistoric beauty, swelled to the consistency of a pomegranate about to burst. Tharnok&rsquo;tail lashed the water into a froth of lukewarm bubbles.
</p>

<p>
A scorpion skittered by, dragging what might have been a lost earring. ”Scavenger thief!” I attempted to say, but my voice cracked like a dried-out violin string. The lake’s shrinking had made everyone jumpy, even the scorpion.
</p>

<p>
By the fifth week, the mire was a diameter of three dead elephants. Tharnok’s dreams of flight got very specific. “I’ve already built the hangar!” he roared, gesturing to a depression in the mud shaped like a dented thimble. “Inside, my skyship: a cave carved from the hides of our greatest predators. It’s called Whipsnake ! It can outrun a thunderstorm and outchew a brick wall!” The other crocs clapped politely, because the alternative was to point out that the closest thing the thimble-hangar had to a skyship was a rotting log with a fern growing out of it.
</p>

<p>
The heat began singing in frequencies that made our earholes hum.
</p>

<p>
“We used to float, now we just lurk …
</p>

<p>
I nearly snorted a geyser. The lake’s depth had collapsed into a puddle, while we piled atop each other like a family of sour grapes. The water evaporated not quietly, but with a sputtering rage that left behind mineral crusts shaped like the scowls of ancient deities.
</p>

<p>
And then, as the sun, our sadistic, gaseous jailer beat down with the enthusiasm of a thousand deranged tambourines, Rex, Cleo’s offspring sauntered in, dragging a gazelle by the haunch. The gazelle, alive, limping but smiling like a martyr at a buffet, sipped mud from the puddle like it was a champagne flute. She nodded, and said, “ I prefer filtered, but thanks.
</p>

<p>
Tharnok nearly choked on his own teeth. “Where’d you find this treasure ?”
</p>

<p>
“In the desert,” said the kid, flicking the gazelle’s flank. "Told me about this oasis it used to live in. Sounds better than this.”
</p>

<p>
We stared. The gazelle yawned and sputtered: “I know, right? The oasis is gone . Now you live in a puddle.”
</p>

<p>
This wasn’t just any gazelle. This was a gazelle who’d clearly read the manual for the apocalypse and still showed up for work.
</p>
</div>
</div>
<div id="outline-container-org1a5ab2a" class="outline-2">
<h2 id="org1a5ab2a">The devouring</h2>
<div class="outline-text-2" id="text-org1a5ab2a">
<p>
Rex, gullet agape, in one swift motion swallowed the gazelle whole, with his gargantuan unhinging jaw, the poor thing&rsquo;s limbs splayed, as if in surrender to the abyss that was Rex&rsquo;s maw. Gobbled. No chewing. No savoring. Just a brutal, sloppy, spectacular consumption, like a swirling vortex of hunger.
</p>

<p>
The gazelle’s soul left in a wet, gurgling sigh. My eyes, saucers of morbid fascination, watched as the gazelle&rsquo;s, now Rex&rsquo;s, contours shifted, rippled, like a living, breathing, digesting sack.
</p>

<p>
Flailing legs, now limp, slid down the gullet, a slow-motion disappearing act, like a phantom swallowed by the void. The gazelle, now mere bulge, slid, an unresisted, gut-wrenching glide, toward the dark recesses of Rex&rsquo;s belly, where digestive juices, an acidic, hellish brew, awaited, eager to dismantle, to desecrate, to destroy.
</p>

<p>
Cleo, Rex’s mother queen of the mud-flat, matriarch of mastication rituals sashayed over, tail slithering like an angry garden hose. Her eyes, yellow as sulfur, narrowed at the carnage.
</p>

<p>
Her tongue lashing like a barbed-wire tongue-in-cheek, hissed, “ A real croc doesn’t chew! He devours ! ” “Once, you’d gnaw a vulture for three weeks. Now?” She gazed at the final remains of the gazelle hooves sliding into his mouth.
</p>

<p>
Tharnok, spat mud at Rex: “Your mom’s right. You were a sloppy eater . Chewing? That’s what hippos do. “Chewers never win the buffet. Only the gulpers survive the feast.”
</p>

<p>
Rex, now a clogged geyser of digestion, burped a foghorn of flatulence that sent geese (all that remained of the ecosystem) spiraling like demented kites. “I’m learning,” he growled, throat vibrating like a cello in a windstorm.
</p>

<p>
Cleo snorted a memory. “Back when you were a green hatchling, still wobbling on your belly, you gnawed a warthog to splinters over three moon cycles. We found it belly-up in the reeds, its tail still twirling like a broken metronome. You had clamped down with all 104 teeth and chewed . Not the violent, efficient chop-gnash of survival. No this was the work of an impressionable child, a gosling that thinks a lake is a napkin. Three moons of crunching, 1000 hours of bite-slop-slobber, each mastication a tribute to the inefficiency of youth.
</p>

<p>
&ldquo;You’d gnaw its hip bones like they were cellophane wrapping,&rdquo; Cleo added, &ldquo;By moon three, half your face was a cheese grater. You didn&rsquo;t stop till it&rsquo;s skull was a jawed masterpiece of fanged architecture.&rdquo;
</p>
</div>
</div>
<div id="outline-container-org3b962a2" class="outline-2">
<h2 id="org3b962a2">The thunderstorm</h2>
<div class="outline-text-2" id="text-org3b962a2">
<p>
The puddle our last, gasping puddle sloshed like a geriatric trampoline when Sheriff Slither arrived, all sinew and scaly swagger. His neck was a cobra’s neck crossed with a doorknob jutting sideways, like evolution had run out of time. Slither’s badge a jagged shard of something that once shined jangled on his chest. He carried a megaphone made from half a clamshell, its rim still glittering with barnacle ghosts.
</p>

<p>
Sheriff Slither&rsquo;s megaphone crackled: &ldquo;EARS DOWN, FLATHEADS! ATMOSPHERIC PRESSURE DROPPING LIKE A PIANO FROM THE SECOND FLOOR! ELECTROMAGNETIC FIELD&rsquo;S GONE FULL FRANKENSTEIN! IT’LL RIP YOUR TONGUES FOR MINGLES IF YOU DON’T DIG DEEPER THAN A WIDOW’S WOE!&rdquo;
</p>

<p>
He paused mid-rant to sneeze a gecko out the left nostril.
</p>

<p>
The puddle, now a scummy eye, squirmed under the weight of 30 croc butts. The mud groaned, a low, wet whump with our every shift. We pushed each other, like gang members huddling to share the last dying cigarette.
</p>

<p>
He was right. The air changed. It thickened. Got hungry. I could taste it ions, feral and metallic, biting my nostrils with teeth made of pure tin. A sharp, clean stink of a universe about to short-circuit.
</p>

<p>
I stood, my back arched in a posture of crocodilian stoicism, as the sky bruised to a shade of purple eggplant-gone-mad. Droplets began to levitate. Just… hung there. Trembling. A billion tiny marionettes with their strings cut, waiting for a new master.
</p>

<p>
Aggregation. The word hissed in my skull, a piece of instinct older than bone. The ions, those tin-foiled devils, were carousing. Jacking up the voltage. They clamped onto the water droplets, forcing them to clump like invisible barbed wire. To merge. This wasn’t rain. This was artillery being built in the sky above our heads.
</p>

<p>
“Thunder’s a giant’s heartbeat,” Slither said, “and that giant’s got a hammer for a knuckle and a temper like your aunt’s hair after a lightning bug zaps her 1920s corset.”
</p>

<p>
“The storm?” He jabbed a claw at the horizon, where clouds clumped like mold on a long-dead bread. “This one’s got a permit to kill. You think your gutbags are safe in this puddle? When the storm comes, it’ll drop anvils where your eyelids were!”
</p>

<p>
Water molecules, those microscopic thugs, started mugging oxygen atoms for their electrons like pickpockets in a cosmic subway. The H₂O gangs swarmed through the atmosphere, ripping electrons clean off unsuspecting nitrogen, yanking charge like bullies. Each stolen electron crackled, a tiny scream of atomic betrayal.
</p>

<p>
Snatch. A hydrogen molecule, minding its own business, suddenly found itself lighter by one electron. The water droplet now electrically charged, drunk on stolen particles wobbled through the air. Grab. Another electron vanished from a passing nitrogen atom, leaving it ionized and furious, buzzing with the indignation of the robbed.
</p>

<p>
The atmosphere became a casino where water always won and physics kept the house edge.
</p>
</div>
</div>
<div id="outline-container-orgdb7dbf9" class="outline-2">
<h2 id="orgdb7dbf9">The crime</h2>
<div class="outline-text-2" id="text-orgdb7dbf9">
<p>
The water molecules above intensified their atomic mugging spree. Oxygen atoms usually law-abiding elements of the periodic table found themselves victims of molecular crime. The droplets, now supercharged with stolen electrons, began their aggregation dance. They merged, consolidated, formed alliances like tiny atmospheric gangsters preparing for the ultimate heist: gravity.
</p>

<p>
Sheriff Slither’s one good eye the other a milky marble of past grievances narrowed on Rex. His neck did that thing, a sideways jut, a question mark made of scales and suspicion.
</p>

<p>
“Rex,” he hissed, the sound a dry leaf skittering across hot stone. “Earlier this morning, a hyena-pack stole a gazelle, prime-grade, from the north bank. Right from under Old Man Buffalo’s nose. You see anything? Hear anything? A giggle, stupid, on the wind? A stripe-furred thief making off with my jurisdiction’s lunch?”
</p>

<p>
Cleo, queen of deflection, matriarch of misdirection, slithered forward. Her tail carved hieroglyphics in the mud, &ldquo;Sheriff,&rdquo; she purred, &ldquo;Rex hasn&rsquo;t left this puddle since the great drought of whenever-it-was. He&rsquo;s been here, digesting&#x2026; water plants. &rdquo;
</p>

<p>
&ldquo;Funny thing about gazelle thefts, Cleo!&rdquo; he announced to the storm-charged sky. &ldquo;They usually end with someone&rsquo;s belly looking like a cargo container.&rdquo;
</p>

<p>
Rex kept his face a mask, stone-cool. “Hyenas? Here? Their laughter’s a sound that curdles milk. I’d have heard. No one smelled anything.”
</p>

<p>
Rex’s belly did a low glorp-whump, a volcanic belch from within. A gazelle hoof, previously thought dissolved, made a brief reappearance at the back of his throat before sliding down again like a guilty witness retreating into protection.
</p>

<p>
“Right,” he drawled, not buying it, just tabling it for later collection. “Well. Keep your nostrils flared. They’re around. And they’re messy eaters. Not like us.” His sulfur-eye flicked to the diminishing puddle, then back to the apocalyptic sky. “This storm, though. This is the main event.”
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: emporas</p>
<p class="date">Created: 2025-09-01 Mon 20:16</p>
</div>
</body>
</html>
